var helpContent = [
    {
        title:"خرید دوره",
        sub:[
            {
                title:"ثبت نام در سایت",
                info:"با وجود این‌که انتظار می‌رقت پش از انتشار خبر آیین‌نامه واردات خودرو، بازار روندی نزولی یه خود بگیرد، اما اتفاق دیگری افتاد، به طوری قیمت خودروها صعودی شد."
            },
            {
                title:"ثبت نام در دوره",
                info:"با وجود این‌که انتظار می‌رقت پش از انتشار خبر آیین‌نامه واردات خودرو، بازار روندی نزولی یه خود بگیرد، اما اتفاق دیگری افتاد، به طوری قیمت خودروها صعودی شد."
            
            },
            {
                title:"لیست دوره های خریداری شده",
                info:"با وجود این‌که انتظار می‌رقت پش از انتشار خبر آیین‌نامه واردات خودرو، بازار روندی نزولی یه خود بگیرد، اما اتفاق دیگری افتاد، به طوری قیمت خودروها صعودی شد."
            
            }
        ]
    },
    {
        title:"خرید دوره",
        sub:[
            {
                title:"لیست دوره های خریداری شده",
                info:"با وجود این‌که انتظار می‌رقت پش از انتشار خبر آیین‌نامه واردات خودرو، بازار روندی نزولی یه خود بگیرد، اما اتفاق دیگری افتاد، به طوری قیمت خودروها صعودی شد."
            
            },
            {
                title:"لیست دوره های خریداری شده",
                info:"با وجود این‌که انتظار می‌رقت پش از انتشار خبر آیین‌نامه واردات خودرو، بازار روندی نزولی یه خود بگیرد، اما اتفاق دیگری افتاد، به طوری قیمت خودروها صعودی شد."
            
            },
            {
                title:"لیست دوره های خریداری شده",
                info:"با وجود این‌که انتظار می‌رقت پش از انتشار خبر آیین‌نامه واردات خودرو، بازار روندی نزولی یه خود بگیرد، اما اتفاق دیگری افتاد، به طوری قیمت خودروها صعودی شد."
            
            }
        ]
    },
    {
        title:"خرید دوره",
        sub:[
            {
                title:"لیست دوره های خریداری شده",
                info:"با وجود این‌که انتظار می‌رقت پش از انتشار خبر آیین‌نامه واردات خودرو، بازار روندی نزولی یه خود بگیرد، اما اتفاق دیگری افتاد، به طوری قیمت خودروها صعودی شد."
            
            },
            {
                title:"لیست دوره های خریداری شده",
                info:"با وجود این‌که انتظار می‌رقت پش از انتشار خبر آیین‌نامه واردات خودرو، بازار روندی نزولی یه خود بگیرد، اما اتفاق دیگری افتاد، به طوری قیمت خودروها صعودی شد."
            
            },
            {
                title:"لیست دوره های خریداری شده",
                info:"با وجود این‌که انتظار می‌رقت پش از انتشار خبر آیین‌نامه واردات خودرو، بازار روندی نزولی یه خود بگیرد، اما اتفاق دیگری افتاد، به طوری قیمت خودروها صعودی شد."
            
            }
        ]
    },
]